; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v7 ?v3)
             (pred_1 ?v10 ?v6)
             (pred_3 ?v7 ?v6)
             (pred_12 ?v9 ?v7 )
	     (pred_2 ?v7)
             (pred_7 ?v4)
             (pred_8 ?v10)
             (pred_4 ?v6)
             (pred_9 ?v7)
             (pred_11 ?v10)
             (pred_6 ?v7)
             (pred_10 ))



(:action op_2
:parameters (?v8 ?v1 ?v12 ?v2)
:precondition (and (pred_7 ?v8) (pred_7 ?v1) (pred_8 ?v12) (pred_4 ?v2)
          (pred_5 ?v8 ?v1) (pred_1 ?v12 ?v2)
                   (pred_3 ?v1 ?v2) (pred_2 ?v8) 
                   (pred_9 ?v1) (pred_11 ?v12))
:effect (and  (pred_6 ?v1) (not (pred_9 ?v1))))


(:action op_4
:parameters (?v8 ?v13)
:precondition (and (pred_7 ?v8) (pred_7 ?v13)
               (pred_2 ?v8) (pred_5 ?v8 ?v13) (pred_6 ?v13))
:effect (and (pred_2 ?v13) (not (pred_2 ?v8))))

(:action op_3
:parameters (?v8 ?v12)
:precondition (and (pred_7 ?v8) (pred_8 ?v12) 
                  (pred_2 ?v8) (pred_12 ?v12 ?v8) (pred_10 ))
:effect (and (pred_11 ?v12)
   (not (pred_12 ?v12 ?v8)) (not (pred_10 ))))


(:action op_5
:parameters (?v8 ?v11 ?v5)
:precondition (and (pred_7 ?v8) (pred_8 ?v11) (pred_8 ?v5)
                  (pred_2 ?v8) (pred_11 ?v5) (pred_12 ?v11 ?v8))
:effect (and (pred_11 ?v11) (pred_12 ?v5 ?v8)
        (not (pred_11 ?v5)) (not (pred_12 ?v11 ?v8))))

(:action op_1
:parameters (?v8 ?v12)
:precondition (and (pred_7 ?v8) (pred_8 ?v12) 
                  (pred_2 ?v8) (pred_11 ?v12))
:effect (and (pred_10 ) (pred_12 ?v12 ?v8) (not (pred_11 ?v12)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_16 obj_20 obj_21 obj_04 obj_30 obj_26 obj_10 obj_28 obj_06 obj_07 obj_23 obj_09 obj_22 obj_08 obj_13 obj_19 obj_11 obj_27 obj_14 obj_02 obj_05 obj_31 obj_24 obj_18 obj_15
    obj_03 obj_29 obj_25
    obj_12 obj_01 obj_17
    )

    (:init
       (pred_10)

       (pred_7 obj_16)
       (pred_7 obj_20)
       (pred_7 obj_21)
       (pred_7 obj_04)
       (pred_7 obj_30)
       (pred_7 obj_26)
       (pred_7 obj_10)
       (pred_7 obj_28)
       (pred_7 obj_06)
       (pred_7 obj_07)
       (pred_7 obj_23)
       (pred_7 obj_09)
       (pred_7 obj_22)
       (pred_7 obj_08)
       (pred_7 obj_13)
       (pred_7 obj_19)
       (pred_7 obj_11)
       (pred_7 obj_27)
       (pred_7 obj_14)
       (pred_7 obj_02)
       (pred_7 obj_05)
       (pred_7 obj_31)
       (pred_7 obj_24)
       (pred_7 obj_18)
       (pred_7 obj_15)
       (pred_4 obj_03)
       (pred_4 obj_29)
       (pred_4 obj_25)
       (pred_8 obj_12)
       (pred_8 obj_01)
       (pred_8 obj_17)

       (pred_5 obj_16 obj_26)
       (pred_5 obj_16 obj_20)
       (pred_5 obj_20 obj_10)
       (pred_5 obj_20 obj_21)
       (pred_5 obj_20 obj_16)
       (pred_5 obj_21 obj_28)
       (pred_5 obj_21 obj_04)
       (pred_5 obj_21 obj_20)
       (pred_5 obj_04 obj_06)
       (pred_5 obj_04 obj_30)
       (pred_5 obj_04 obj_21)
       (pred_5 obj_30 obj_07)
       (pred_5 obj_30 obj_04)
       (pred_5 obj_26 obj_23)
       (pred_5 obj_26 obj_10)
       (pred_5 obj_26 obj_16)
       (pred_5 obj_10 obj_09)
       (pred_5 obj_10 obj_28)
       (pred_5 obj_10 obj_20)
       (pred_5 obj_10 obj_26)
       (pred_5 obj_28 obj_22)
       (pred_5 obj_28 obj_06)
       (pred_5 obj_28 obj_21)
       (pred_5 obj_28 obj_10)
       (pred_5 obj_06 obj_08)
       (pred_5 obj_06 obj_07)
       (pred_5 obj_06 obj_04)
       (pred_5 obj_06 obj_28)
       (pred_5 obj_07 obj_13)
       (pred_5 obj_07 obj_30)
       (pred_5 obj_07 obj_06)
       (pred_5 obj_23 obj_19)
       (pred_5 obj_23 obj_09)
       (pred_5 obj_23 obj_26)
       (pred_5 obj_09 obj_11)
       (pred_5 obj_09 obj_22)
       (pred_5 obj_09 obj_10)
       (pred_5 obj_09 obj_23)
       (pred_5 obj_22 obj_27)
       (pred_5 obj_22 obj_08)
       (pred_5 obj_22 obj_28)
       (pred_5 obj_22 obj_09)
       (pred_5 obj_08 obj_14)
       (pred_5 obj_08 obj_13)
       (pred_5 obj_08 obj_06)
       (pred_5 obj_08 obj_22)
       (pred_5 obj_13 obj_02)
       (pred_5 obj_13 obj_07)
       (pred_5 obj_13 obj_08)
       (pred_5 obj_19 obj_05)
       (pred_5 obj_19 obj_11)
       (pred_5 obj_19 obj_23)
       (pred_5 obj_11 obj_31)
       (pred_5 obj_11 obj_27)
       (pred_5 obj_11 obj_09)
       (pred_5 obj_11 obj_19)
       (pred_5 obj_27 obj_24)
       (pred_5 obj_27 obj_14)
       (pred_5 obj_27 obj_22)
       (pred_5 obj_27 obj_11)
       (pred_5 obj_14 obj_18)
       (pred_5 obj_14 obj_02)
       (pred_5 obj_14 obj_08)
       (pred_5 obj_14 obj_27)
       (pred_5 obj_02 obj_15)
       (pred_5 obj_02 obj_13)
       (pred_5 obj_02 obj_14)
       (pred_5 obj_05 obj_31)
       (pred_5 obj_05 obj_19)
       (pred_5 obj_31 obj_24)
       (pred_5 obj_31 obj_11)
       (pred_5 obj_31 obj_05)
       (pred_5 obj_24 obj_18)
       (pred_5 obj_24 obj_27)
       (pred_5 obj_24 obj_31)
       (pred_5 obj_18 obj_15)
       (pred_5 obj_18 obj_14)
       (pred_5 obj_18 obj_24)
       (pred_5 obj_15 obj_02)
       (pred_5 obj_15 obj_18)
       (pred_9 obj_13)
       (pred_9 obj_24)
       (pred_9 obj_21)
       (pred_3  obj_13 obj_03)
       (pred_3  obj_24 obj_29)
       (pred_3  obj_21 obj_25)
       (pred_6 obj_16)
       (pred_6 obj_20)
       (pred_6 obj_04)
       (pred_6 obj_30)
       (pred_6 obj_26)
       (pred_6 obj_10)
       (pred_6 obj_28)
       (pred_6 obj_06)
       (pred_6 obj_07)
       (pred_6 obj_23)
       (pred_6 obj_09)
       (pred_6 obj_22)
       (pred_6 obj_08)
       (pred_6 obj_19)
       (pred_6 obj_11)
       (pred_6 obj_27)
       (pred_6 obj_14)
       (pred_6 obj_02)
       (pred_6 obj_05)
       (pred_6 obj_31)
       (pred_6 obj_18)
       (pred_6 obj_15)

       (pred_1  obj_12 obj_03)
       (pred_1  obj_01 obj_29)
       (pred_1  obj_17 obj_25)
       (pred_12 obj_12 obj_15)
       (pred_12 obj_01 obj_31)
       (pred_12 obj_17 obj_27)
       (pred_2 obj_09)
    )

    (:goal (and
       (pred_12 obj_01 obj_15)
    ))
(:constraints
  (always (not (pred_2 obj_24)))
)
)

; plan
1. (op_4 obj_09 obj_11)
   deleted: (pred_2 obj_09)
   added: (pred_2 obj_11)
   goals met: 0 of 1
2. (op_4 obj_11 obj_31)
   deleted: (pred_2 obj_11)
   added: (pred_2 obj_31)
   goals met: 0 of 1
3. (op_3 obj_31 obj_01)
   deleted: (pred_12 obj_01 obj_31) (pred_10)
   added: (pred_11 obj_01)
   goals met: 0 of 1
4. (op_4 obj_31 obj_11)
   deleted: (pred_2 obj_31)
   added: (pred_2 obj_11)
   goals met: 0 of 1
5. (op_4 obj_11 obj_27)
   deleted: (pred_2 obj_11)
   added: (pred_2 obj_27)
   goals met: 0 of 1
6. (op_4 obj_27 obj_14)
   deleted: (pred_2 obj_27)
   added: (pred_2 obj_14)
   goals met: 0 of 1
7. (op_4 obj_14 obj_02)
   deleted: (pred_2 obj_14)
   added: (pred_2 obj_02)
   goals met: 0 of 1
8. (op_4 obj_02 obj_15)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_15)
   goals met: 0 of 1
9. (op_5 obj_15 obj_12 obj_01)
   deleted: (pred_11 obj_01) (pred_12 obj_12 obj_15)
   added: (pred_11 obj_12) (pred_12 obj_01 obj_15)
   goals met: 1 of 1
